ID2208/OnlineBookStoreComposite/src/jbiServiceUnits/OnlineBookStoreBpel/Partners/BookStore.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="BookStore" targetNamespace="http://j2ee.netbeans.org/wsdl/BookStore"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/BookStore" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:ns1="http://xml.netbeans.org/schema/BookStore">
    <types>
        <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/BookStore" xmlns:ns1="http://xml.netbeans.org/schema/BookStore">
            <xsd:import namespace="http://xml.netbeans.org/schema/BookStore" schemaLocation="BookStore.xsd"/>
        </xsd:schema>
    </types>
    <message name="BookStoreOperationRequest">
        <part name="input" element="ns1:buyBookRequest"/>
    </message>
    <message name="BookStoreOperationResponse">
        <part name="output" element="ns1:buyBookResponse"/>
    </message>
    <portType name="BookStorePortType">
        <operation name="BookStoreOperation">
            <input name="input1" message="tns:BookStoreOperationRequest"/>
            <output name="output1" message="tns:BookStoreOperationResponse"/>
        </operation>
    </portType>
    <binding name="BookStoreBinding" type="tns:BookStorePortType">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="BookStoreOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal"/>
            </input>
            <output name="output1">
                <soap:body use="literal"/>
            </output>
        </operation>
    </binding>
    <service name="BookStoreService">
        <port name="BookStorePort" binding="tns:BookStoreBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/BookStoreService/BookStorePort"/>
        </port>
    </service>
    <plnk:partnerLinkType name="BookStore">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="BookStorePortTypeRole" portType="tns:BookStorePortType"/>
    </plnk:partnerLinkType>
</definitions>
