trunk/ID2208/test/OrderWithoutShipment/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:book="http://xml.netbeans.org/schema/BookStore">
  <soapenv:Body>
    <book:buyBookRequest>
      <book:username>wangyu</book:username>
      <book:password>wangyu</book:password>
      <book:bookTitle>Web Service</book:bookTitle>
      <book:creditcard>12345</book:creditcard>
    </book:buyBookRequest>
  </soapenv:Body>
</soapenv:Envelope>