ID2208/OnlineBookStoreComposite/test/ShipmentCancelled/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:book="http://xml.netbeans.org/schema/BookStore">
  <soapenv:Body>
    <book:buyBookRequest>
      <book:username>jintao</book:username>
      <book:password>jintao</book:password>
      <book:bookTitle>Java</book:bookTitle>
      <book:creditcard>54321</book:creditcard>
    </book:buyBookRequest>
  </soapenv:Body>
</soapenv:Envelope>